<template>
  <div>
    <h2>{{ title }}</h2>
    <h3>{{ subtitle }}</h3>
    <h4>{{ description }}</h4>
    <div class="question">
      <div class="count"><span>{{this.quizNumber + 1}}</span> из {{ this.quiz.length }}</div>
      <h5>{{ quiz[this.quizNumber].q }}</h5>
      <div class="answers">
        <button class="btn" v-for="answer in quiz[this.quizNumber].a" @click="quizAction" :value="answer" >{{ answer }}</button>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  name: 'q1',
  data(){
    return {
      quizNumber: 0,
      title: 'Методика №1',
      subtitle: 'Методика диагностики склонности к формированию ошибочных установок разного уровня А.А. Шахова и С.А. Башкатова',
      description: 'Прочитайте внимательно каждое утверждение и отметьте тот ответ в столбике, который больше всего соответствует Вашему мнению.',
      quiz: [
        {
          id: 1,
          q: 'Я редко изменяю своим жизненным привычкам, что приводит к сложностям в общении с людьми.',
          a: ['Да', 'Нет']
        },
        {
          id: 2,
          q: 'Когда я слушаю собеседника, то постепенно перестаю следить за каждым его словом, отвлекаюсь на попытки предугадать смысл всей его речи. Это зачастую приводит к тому, что я упускаю содержание информации, высказанной собеседником.',
          a: ['Да', 'Нет']
        },
        {
          id: 3,
          q: 'Бывает, что я раз за разом совершаю опрометчивые поступки, о которых потом сожалею.',
          a: ['Да', 'Нет']
        },
        {
          id: 4,
          q: 'После многократных безуспешных попыток я в последнее время не стремлюсь непременно повышать свой социальный статус.',
          a: ['Да', 'Нет']
        },
        {
          id: 5,
          q: 'Я убежден, что новые хобби не принесут мне радости, все что мне нужно у меня уже есть.',
          a: ['Да', 'Нет']
        },
        {
          id: 6,
          q: 'Проверяя наличие опечаток в своем письме или в набранном компьютерном тексте, я часто их не замечаю.',
          a: ['Да', 'Нет']
        },
        {
          id: 7,
          q: 'Я, не очень надеясь на успешный результат, склонен работать медленно, но равномерно.',
          a: ['Да', 'Нет']
        },
        {
          id: 8,
          q: 'У меня не вызывает сомнений, что противоречивые точки зрения, излагаемые средствами массовой информации, только запутывают людей.',
          a: ['Да', 'Нет']
        },
        {
          id: 9,
          q: 'В общении с людьми я стараюсь придерживаться своих правил, с чем не согласны многие из моих друзей.',
          a: ['Да', 'Нет']
        },
        {
          id: 10,
          q: 'Я более или менее неплохо запоминаю лица людей, но для меня настоящая проблема вспомнить даже после нескольких встреч их имена, а тем более фамилии, хотя мне их называли.',
          a: ['Да', 'Нет']
        },
        {
          id: 11,
          q: 'Я часто не довожу начатое дело до конца, хотя мне часто указывают на это.',
          a: ['Да', 'Нет']
        },
        {
          id: 12,
          q: 'Очевидно, что при обсуждении моральных проблем нужно целиком полагаться на религиозные принципы населения.',
          a: ['Да', 'Нет']
        },
        {
          id: 13,
          q: 'Мне нравится пробовать новые зачастую экзотические блюда, хотя не все это одобряют.',
          a: ['Да', 'Нет']
        },
        {
          id: 14,
          q: 'Я часто забываю содержание своей речи во время выступления, хотя тщательно к нему готовился, многократно репетировал.',
          a: ['Да', 'Нет']
        },
        {
          id: 15,
          q: 'Я четко осознаю, что большинство целей в жизни не достигаемы.',
          a: ['Да', 'Нет']
        },
        {
          id: 16,
          q: 'История человечества показывает, что восприятие людьми всего нового опасно без учета верности сложившимся традициям.',
          a: ['Да', 'Нет']
        },
        {
          id: 17,
          q: 'Я люблю отдыхать в привычной для меня обстановке, и это не всегда нравится моим близким.',
          a: ['Да', 'Нет']
        },
        {
          id: 18,
          q: 'По своему опыту знаю, что если я выучу какой-либо материал до автоматизма (например, правила дорожного движения), остаюсь не застрахованным от ошибки при его воспроизведении.',
          a: ['Да', 'Нет']
        },
        {
          id: 19,
          q: 'Мне очень нравится народная поговорка: «Терпенье и труд все перетрут!»',
          a: ['Да', 'Нет']
        },
        {
          id: 20,
          q: 'Я искренне убежден, что социальная защищенность человека, выражающаяся в обеспечении его всем необходимым, является главной ценностью человечества.',
          a: ['Да', 'Нет']
        },
        {
          id: 21,
          q: 'Бывает, что я для своего удовольствия делаю дома перестановку, хотя понимаю, что это может вызывать удивление моих знакомых.',
          a: ['Да', 'Нет']
        },
        {
          id: 22,
          q: 'В моей речи, к сожалению, присутствует большое количество слов-паразитов (короче, так сказать, прикинь и т.п.) и я никак не могу от них избавиться.',
          a: ['Да', 'Нет']
        },
        {
          id: 23,
          q: 'Я по жизни вялый и немного ленивый человек, но ничего не могу с этим поделать.',
          a: ['Да', 'Нет']
        },
        {
          id: 24,
          q: 'Не вызывает сомнений, что только полное удовлетворение потребностей человека в пище, одежде, жилище и сексе может способствовать его реальному участию в развитии справедливого общества.',
          a: ['Да', 'Нет']
        },
        {
          id: 25,
          q: 'Мне нравится прогуливаться в одних и тех же любимых местах, что кажется некоторым скучным.',
          a: ['Да', 'Нет']
        },
        {
          id: 26,
          q: 'К моему великому сожалению, я способен решать математические задачи только по образцу, который находится у меня перед глазами.',
          a: ['Да', 'Нет']
        },
        {
          id: 27,
          q: 'У меня всегда есть четкие позитивные цели, и я последовательно и неумолимо двигаюсь к их достижению.',
          a: ['Да', 'Нет']
        },
        {
          id: 28,
          q: 'По моему мнению, в связи с социальным прогрессом общества пришло время пересмотреть социальную значимость таких общечеловеческих ценностей, как брак и семья, счастливой детство, обеспеченная старость и др.',
          a: ['Да', 'Нет']
        },
        {
          id: 29,
          q: 'Я стараюсь придерживаться одного и того же маршрута передвижения, что не всегда удобно моим компаньонам.',
          a: ['Да', 'Нет']
        },
        {
          id: 30,
          q: 'Сам не знаю почему, но мне не дается изучение других языков: несмотря на многократное повторение иностранные слова как будто не способны закрепиться в моей голове.',
          a: ['Да', 'Нет']
        },
        {
          id: 31,
          q: 'Я много раз пытался самосовершенствоваться, но всегда бросал это неблагодарное занятие.',
          a: ['Да', 'Нет']
        },
        {
          id: 32,
          q: 'Мне не стыдно признаться в том, что играя в развлекательные (не азартные) игры я зачастую жульничаю.',
          a: ['Да', 'Нет']
        },
        {
          id: 33,
          q: 'Если я что-то готовлю, например, яичницу то делаю это всегда одинаково, автоматически, поэтому не всегда блюдо получается удачным.',
          a: ['Да', 'Нет']
        },
        {
          id: 34,
          q: 'Мне трудно раз за разом устоять перед соблазнами, хотя я ясно осознаю этот недостаток.',
          a: ['Да', 'Нет']
        },
        {
          id: 35,
          q: 'Я благодарен родителям и близким людям, которые меня с детства учили, чтобы я настойчиво работал для достижения социально значимых целей.',
          a: ['Да', 'Нет']
        },
        {
          id: 36,
          q: 'На мой взгляд, воровство и коррупция на сегодняшний день перестали быть общественно неприемлемыми явлениями, нужно лишь, чтобы они носили умеренный характер.',
          a: ['Да', 'Нет']
        },
        {
          id: 37,
          q: 'Если я выполняю домашнюю работу, например, уборку квартиры, то это представляет строгий ритуал последовательных действий.',
          a: ['Да', 'Нет']
        },
        {
          id: 38,
          q: 'Мне трудно считать в уме, например, общую стоимость нескольких приобретаемых товаров, поэтому мне приходится постоянно надеяться на умственные способности и честность продавца.',
          a: ['Да', 'Нет']
        },
        {
          id: 39,
          q: 'Я с удивлением осознаю, что для меня работа представляет собой наркотик, без которого я просто чахну. Тем не менее, большинство коллег считает это моим достоинством.',
          a: ['Да', 'Нет']
        },
        {
          id: 40,
          q: 'Я думаю, что в современном обществе на сегодняшний день честный труд не является добродетелью, а выступает, скорее, признаком социальной недальновидности.',
          a: ['Да', 'Нет']
        }
      ],
      q1: [{id: 1, a: false }, {id: 2, a: false }, {id: 3, a: false }, {id: 4, a: false }, {id: 5, a: false }, {id: 6, a: false }, {id: 7, a: false }, {id: 8, a: false }, {id: 9, a: false }, {id: 10, a: false }, {id: 11, a: false }, {id: 12, a: false }, {id: 13, a: false }, {id: 14, a: false }, {id: 15, a: false }, {id: 16, a: false }, {id: 17, a: false }, {id: 18, a: false }, {id: 19, a: false }, {id: 20, a: false }, {id: 21, a: false }, {id: 22, a: false }, {id: 23, a: false }, {id: 24, a: false }, {id: 25, a: false }, {id: 26, a: false }, {id: 27, a: false }, {id: 28, a: false }, {id: 29, a: false }, {id: 30, a: false }, {id: 31, a: false }, {id: 32, a: false }, {id: 33, a: false }, {id: 34, a: false }, {id: 35, a: false }, {id: 36, a: false }, {id: 37, a: false }, {id: 38, a: false }, {id: 39, a: false }, {id: 40, a: false }]
    }
  },
  mounted() {
    if (localStorage.q1){
      this.q1 = JSON.parse(localStorage.q1);
      this.q1.forEach((item, i) => {
        if(item.a){
          this.quizNumber = i + 1;
          if( this.quizNumber >= this.q1.length ){
            this.$parent.quizNumber = this.$parent.quizNumber + 1;
          }
        }
      });
    }
  },
  methods: {
    quizAction(e) {
      let newArr = this.q1;
      newArr[this.quizNumber].a = e.target.value;
      this.q1 = newArr;
      localStorage.q1 = JSON.stringify(newArr);
      this.quizNumber = this.quizNumber + 1;
      if( this.quizNumber >= this.q1.length ){
        this.$parent.quizNumber = this.$parent.quizNumber + 1;
      }
    }
  }
}
</script>
