<template>
  <div>
    <h2>{{ title }}</h2>
    <h3>{{ subtitle }}</h3>
    <h4>{{ description }}</h4>
    <div class="question">
      <div class="count"><span>{{this.quizNumber + 1}}</span> из {{ this.quiz.length }}</div>
      <h5>{{ quiz[this.quizNumber].q }}</h5>
      <div class="answers">
        <button class="btn" v-for="answer in quiz[this.quizNumber].a" @click="quizAction" :value="answer" >{{ answer }}</button>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  name: 'q11',
  data(){
    return {
      quizNumber: 0,
      title: 'Методика №1',
      subtitle: 'Методика диагностики склонности к формированию ошибочных установок разного уровня А.А. Шахова и С.А. Башкатова',
      description: 'Прочитайте внимательно каждое утверждение и отметьте тот ответ в столбике, который больше всего соответствует Вашему мнению.',
      quiz: [
        {
          id: 1,
          q: 'Я не изменяю своим взглядам на жизнь (привычкам) и это часто приводит к осложнениям в отношениях с людьми.',
          a: ['Да', 'Нет']
        },
        {
          id: 2,
          q: 'Когда я слушаю собеседника, часто бывает, что я догадываюсь о том, что он хочет сказать по первым фразам, не дослушиваю его до конца и сразу отвечаю. При этом зачастую оказывается, что я неправильно понял(-а) его. ',
          a: ['Да', 'Нет']
        },
        {
          id: 3,
          q: 'Часто бывает, что я совершаю опрометчивые поступки, о которых потом сожалею.',
          a: ['Да', 'Нет']
        },
        {
          id: 4,
          q: 'Я много раз пытался(-ась) достичь успеха в жизни, но у меня не получалось и сейчас я оставил (-а) эти попытки',
          a: ['Да', 'Нет']
        },
        {
          id: 5,
          q: 'Я считаю, что новые хобби не доставят мне большей радости, чем те, что у меня уже есть.',
          a: ['Да', 'Нет']
        },
        {
          id: 6,
          q: 'Часто в моих текстах встречаются опечатки несмотря на то, что я их проверял (-а).',
          a: ['Да', 'Нет']
        },
        {
          id: 7,
          q: 'Когда я не очень уверен (а), что добьюсь успеха в каком-то деле,  я его избегаю и оттягиваю',
          a: ['Да', 'Нет']
        },
        {
          id: 8,
          q: 'Я считаю, что множество точек зрения, часто противоречащих друг другу на одну и ту же проблему только запутывают людей. В СМИ нужно публиковать только одну, но правильную точку зрения.  ',
          a: ['Да', 'Нет']
        },
        {
          id: 9,
          q: 'В общении с людьми я стараюсь придерживаться своих правил и людям это часто не нравится',
          a: ['Да', 'Нет']
        },
        {
          id: 10,
          q: 'У меня хорошая память на лица людей, но не редко я не могу вспомнить их имена. ',
          a: ['Да', 'Нет']
        },
        {
          id: 11,
          q: 'Я часто не довожу дела до конца.',
          a: ['Да', 'Нет']
        },
        {
          id: 12,
          q: 'Я считаю, что без религии у человека не может быть морали. ',
          a: ['Да', 'Нет']
        },
        {
          id: 13,
          q: 'Мне нравится пробовать новые необычные блюда.',
          a: ['Да', 'Нет']
        },
        {
          id: 14,
          q: 'Я часто забываю содержание своей речи во время выступления, хотя готовился (-лась) и репетировал (-а) ее.',
          a: ['Да', 'Нет']
        },
        {
          id: 15,
          q: 'Я пришел (-шла) к выводу, что большинство целей в жизни, которые я ставил (-а) перед собой, не достижимы.',
          a: ['Да', 'Нет']
        },
        {
          id: 16,
          q: 'Мне кажется, что если человечество перестанет следовать старым проверенным традициям, то это приведет к деградации общества',
          a: ['Да', 'Нет']
        },
        {
          id: 17,
          q: 'Я люблю отдыхать в привычной для меня обстановке, потому что считаю, что не найду в новых местах ничего интересного. ',
          a: ['Да', 'Нет']
        },
        {
          id: 18,
          q: 'Со мной часто бывает: что я раньше изучал (-а), в нужный момент я не могу вспомнить.',
          a: ['Да', 'Нет']
        },
        {
          id: 19,
          q: 'Я считаю, что достижение целей в жизни возможно больше терпеливым трудом, чем удачей.',
          a: ['Да', 'Нет']
        },
        {
          id: 20,
          q: 'Я считаю, что материальные достижения человека, такие как богатство, известность, более значимы, чем его нравственность.',
          a: ['Да', 'Нет']
        },
        {
          id: 21,
          q: 'Я люблю менять: внешность, обстановку в доме, хобби и не обращаю внимание на то, что такие частые смены удивляют других. ',
          a: ['Да', 'Нет']
        },
        {
          id: 22,
          q: 'В моей речи часто встречаются слова-паразиты («эээ», «так сказать», «короче», «ну, в общем») и современный сленг («прикольно», «драйв»,…). ',
          a: ['Да', 'Нет']
        },
        {
          id: 23,
          q: 'Если честно, я довольно ленивый человек, но ничего не могу с этим поделать.',
          a: ['Да', 'Нет']
        },
        {
          id: 24,
          q: 'Я считаю, что людей сначала нужно накормить, обеспечить всем необходимым, включая развлечения и лишь потом они смогут участвовать в построении социально-справедливого общества.',
          a: ['Да', 'Нет']
        },
        {
          id: 25,
          q: 'Я люблю гулять в одних и тех же местах.',
          a: ['Да', 'Нет']
        },
        {
          id: 26,
          q: 'При решении разных математических задач или головоломок, я, если есть такая возможность, сразу посмотрю ответ, а не буду ломать голову и искать решение, которое уже готово. ',
          a: ['Да', 'Нет']
        },
        {
          id: 27,
          q: 'У меня всегда есть позитивные цели, и я последовательно двигаюсь к их достижению.',
          a: ['Да', 'Нет']
        },
        {
          id: 28,
          q: 'Я искренне считаю, что в наше время брак и семья – пережитки прошлого.',
          a: ['Да', 'Нет']
        },
        {
          id: 29,
          q: 'Я теряюсь и волнуюсь, если мне приходится изменить привычный маршрут, либо когда что-то идет не по плану.',
          a: ['Да', 'Нет']
        },
        {
          id: 30,
          q: 'Я удивляюсь способности людей точно выражать свои мысли. У меня так не получается.',
          a: ['Да', 'Нет']
        },
        {
          id: 31,
          q: 'Я много раз пытался изучать иностранный язык, заниматься спортом или выработать у себя какую-то привычку «с понедельника» или «с нового года», но меня хватало ненадолго.  ',
          a: ['Да', 'Нет']
        },
        {
          id: 32,
          q: 'Я считаю, что если можно в какой-то игре или в каком-то деле обойти правила и это никто не заметит (например, воспользоваться шпаргалкой на экзамене), то это допустимо, ведь «победителей не судят». ',
          a: ['Да', 'Нет']
        },
        {
          id: 33,
          q: 'Я предпочитаю не менять привычные способы действий. Например, я готовлю одни и те же блюда по привычным рецептам и не считаю нужным что-то менять. ',
          a: ['Да', 'Нет']
        },
        {
          id: 34,
          q: 'Честно говоря, мне сложно удержатся перед соблазном (например, съесть сладкое), хотя я много раз зарекался это не делать.',
          a: ['Да', 'Нет']
        },
        {
          id: 35,
          q: 'В первую очередь всех детей я учил бы тому, что только упрямая настойчивость помогут достичь практически любых целей. ',
          a: ['Да', 'Нет']
        },
        {
          id: 36,
          q: 'Я считаю вполне приемлемым, если какой-то хороший человек может дать небольшую взятку инспектору ГИБДД или преподавателю, чтобы решить проблему – ведь это все делают. Главное, чтобы все было умеренно. ',
          a: ['Да', 'Нет']
        },
        {
          id: 37,
          q: 'Я люблю все делать по заведенному мной порядку. Например, при уборке квартиры, я делаю ее в строгом порядке, как привык (-ла), и если кто-то делает по-иному, это вызывает мое удивление, а иногда и недовольство.',
          a: ['Да', 'Нет']
        },
        {
          id: 38,
          q: 'Четно говоря, я редко проверяю честность продавца, когда он дает сдачи потому, что мне неохота считать в уме.',
          a: ['Да', 'Нет']
        },
        {
          id: 39,
          q: 'Мне очень сложно отвлечься полностью от работы. У меня всегда ее много, и если выдается какое-то время для отдыха, я вздыхаю с облегчением, когда оно заканчивается и я могу снова приступить к своей работе.',
          a: ['Да', 'Нет']
        },
        {
          id: 40,
          q: 'Я все чаще нахожу, что честным в современным обществе быть невыгодно и те, кто всегда принципиально честны, отстают от жизни, надо быть гибче.',
          a: ['Да', 'Нет']
        }
      ],
      q1: [{id: 1, a: false }, {id: 2, a: false }, {id: 3, a: false }, {id: 4, a: false }, {id: 5, a: false }, {id: 6, a: false }, {id: 7, a: false }, {id: 8, a: false }, {id: 9, a: false }, {id: 10, a: false }, {id: 11, a: false }, {id: 12, a: false }, {id: 13, a: false }, {id: 14, a: false }, {id: 15, a: false }, {id: 16, a: false }, {id: 17, a: false }, {id: 18, a: false }, {id: 19, a: false }, {id: 20, a: false }, {id: 21, a: false }, {id: 22, a: false }, {id: 23, a: false }, {id: 24, a: false }, {id: 25, a: false }, {id: 26, a: false }, {id: 27, a: false }, {id: 28, a: false }, {id: 29, a: false }, {id: 30, a: false }, {id: 31, a: false }, {id: 32, a: false }, {id: 33, a: false }, {id: 34, a: false }, {id: 35, a: false }, {id: 36, a: false }, {id: 37, a: false }, {id: 38, a: false }, {id: 39, a: false }, {id: 40, a: false }]
    }
  },
  mounted() {
    if (localStorage.q1){
      this.q1 = JSON.parse(localStorage.q1);
      this.q1.forEach((item, i) => {
        if(item.a){
          this.quizNumber = i + 1;
          if( this.quizNumber >= this.q1.length ){
            this.$parent.quizNumber = this.$parent.quizNumber + 1;
          }
        }
      });
    }
  },
  methods: {
    quizAction(e) {
      let newArr = this.q1;
      newArr[this.quizNumber].a = e.target.value;
      this.q1 = newArr;
      localStorage.q1 = JSON.stringify(newArr);
      this.quizNumber = this.quizNumber + 1;
      if( this.quizNumber >= this.q1.length ){
        this.$parent.quizNumber = this.$parent.quizNumber + 1;
      }
    }
  }
}
</script>
