<template>
  <div class="quesion">
    <h2>{{ title }}</h2>
    <h3>{{ subtitle }}</h3>
    <h4>{{ description }}</h4>
    <div class="question">
      <div class="count"><span>{{this.quizNumber + 1}}</span> из {{ this.quiz.length }}</div>
      <h5>{{ quiz[this.quizNumber].q }}</h5>
      <div class="answers">
        <button class="btn" v-for="answer in quiz[this.quizNumber].a" @click="quizAction" :value="answer" >{{ answer }}</button>
      </div>
    </div>
  </div>
</template>
<script>
export default {
  name: 'q2',
  data(){
    return {
      quizNumber: 0,
      title: 'Методика № 2',
      subtitle: 'Личностный опросник NEO PI-R P. Costa и R. McCrae «Большая пятерка» в адаптации В.Е. Орла и И.Г. Сенина',
      description: 'Прочитайте внимательно каждое утверждение и отметьте тот ответ, который больше всего соответствует Вашему мнению.',
      quiz: [
        {
          id: 1,
          q: 'Я редко испытываю чувство беспокойства',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 2,
          q: 'Мне нравится большинство людей, с которыми я встречаюсь',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 3,
          q: 'У меня очень богатое воображение',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 4,
          q: 'Я склонен цинично и скептично оценивать намерения других людей',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 5,
          q: 'Меня считают осторожным и здравомыслящим человеком',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 6,
          q: 'Обращение людей со мной часто вызывает у меня злость',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 7,
          q: 'Я избегаю больших скоплений людей',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 8,
          q: 'Вопросы эстетики и искусства не очень важны для меня',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 9,
          q: 'Я человек хитрый и не коварный',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 10,
          q: 'Я предпочитаю принимать решения спонтанно, исходя из ситуации, чем планировать все заранее',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 11,
          q: 'Я редко чувствую себя одиноким и печальным',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 12,
          q: 'Я человек склонный к лидерству, напористый и уверенный в себе',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 13,
          q: 'Без сильных эмоций жизнь была бы мне не интересна',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 14,
          q: 'Некоторые люди считают меня самовлюбленным и эгоистичным',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 15,
          q: 'Все задания, которые мне поручают, я стараюсь выполнять добросовестно',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 16,
          q: 'Когда я имею дело с людьми, я всегда боюсь сделать что-то не так',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 17,
          q: 'Работаю я или отдыхаю, я все делаю не спеша',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 18,
          q: 'В поведении и действиях я редко изменяю своим привычкам',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 19,
          q: 'В общении с людьми я предпочитаю не соперничество, а сотрудничество',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 20,
          q: 'Я вялый и немного ленивый человек',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 21,
          q: 'Я редко отказываю себе в каких-либо удовольствиях',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 22,
          q: 'Мне часто нестерпимо хочется острых ощущений',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 23,
          q: 'Мне часто нравится играть в уме с различными теориями и абстрактными идеями',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 24,
          q: 'Я не вижу ничего зазорного в хвастовстве своими талантами и достижениями',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 25,
          q: 'Я вполне успешно поддерживаю стабильный темп работы, чтобы успеть сделать все вовремя',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 26,
          q: 'Часто я чувствую себя беспомощным и хочу, чтобы кто-нибудь другой решил мои проблемы',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 27,
          q: 'Я никогда не прыгал от радости в буквальном смысле этого слова',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 28,
          q: 'Я считаю, что позволяя студентам или учащимся слушать противоречивые точки зрения, их можно только запутать и ввести в заблуждение',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 29,
          q: 'В политике необходимо уделять больше внимания человеческому аспекту, нежели холодной логике и расчету',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 30,
          q: 'В жизни я совершал довольно много глупых поступков',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 31,
          q: 'Меня легко напугать',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 32,
          q: 'Общение с людьми не доставляет мне большого удовольствия',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 33,
          q: 'Я стараюсь мыслить реалистично, избегая полетов фантазии',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 34,
          q: 'Мне кажется, что большинство людей имеют добрые намерения',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 35,
          q: 'Я не придаю большого значения выполнению таких гражданских обязанностей как, например, голосование',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 36,
          q: 'Я уравновешенный человек',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 37,
          q: 'Я люблю, когда вокруг меня много людей',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 38,
          q: 'Иногда я бываю полностью поглощен музыкой, которую слушаю',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 39,
          q: 'При необходимости я могу манипулировать людьми, чтобы добиться того, чего я хочу',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 40,
          q: 'Я содержу свои вещи в чистоте и порядке',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 41,
          q: 'Иногда я чувствую, что абсолютно ничего не стою',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 42,
          q: 'Иногда я проявляю недостаточную настойчивость в отстаивании своих взглядов',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 43,
          q: 'Я редко испытываю сильные эмоции',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 44,
          q: 'Я стараюсь быть вежливым со всем людьми, которых встречаю',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 45,
          q: 'Временами я бываю не настолько надежен и ответственен, как должен бы быть',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 46,
          q: 'Я редко чувствую себя неловко среди людей',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 47,
          q: 'Если я делаю что-то, то делаю это энергично',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 48,
          q: 'Я считаю, что осваивать новые хобби интересно',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 49,
          q: 'Когда мне нужно, я могу быть саркастичным и язвительным',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 50,
          q: 'У меня есть четкие цели, и я последовательно двигаюсь к их достижению',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 51,
          q: 'Мне трудно обуздать свои страстные желания',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 52,
          q: 'Мне бы не хотелось сходить в казино/бар/клуб',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 53,
          q: 'Мне скучны философские рассуждения',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 54,
          q: 'Я не люблю говорить о себе и о своих достижениях',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 55,
          q: 'Я трачу много времени впустую, прежде чем окончательно сажусь за работу',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 56,
          q: 'Я чувствую, что могу справиться с большинством своих проблем',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 57,
          q: 'В моей жизни были ситуации, когда я испытывал большую радость или восторг',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 58,
          q: 'Я думаю, что устоявшиеся законы и традиции должны меняться в соответствии с изменениями окружающего мира',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 59,
          q: 'Я упрям и непреклонен в своих взглядах',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 60,
          q: 'Прежде чем принять решение я все хорошо обдумываю',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 61,
          q: 'Я редко испытываю чувство страха или тревоги',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 62,
          q: 'Меня считают добрым и приветливым человеком',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 63,
          q: 'Я часто фантазирую',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 64,
          q: 'Я считаю, что большинство людей будут использовать тебя в своих целях, если им это только позволить',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 65,
          q: 'Я стараюсь быть в курсе дел и обычно принимаю разумные решения',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 66,
          q: 'Меня считают вспыльчивым и раздражительным человеком',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 67,
          q: 'Я обычно предпочитаю заниматься чем-либо в одиночестве',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 68,
          q: 'Мне скучно смотреть балет и современные танцы',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 69,
          q: 'Я не смог бы никого обмануть, даже если бы хотел',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 70,
          q: 'Я не очень методичный человек',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 71,
          q: 'Я редко грущу или нахожусь в подавленном состоянии',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 72,
          q: 'Я часто становился лидером групп, к которым принадлежал',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 73,
          q: 'Для меня важно то, что я чувствую относительно различных явлений или предметов',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 74,
          q: 'Некоторые люди считают меня холодным и расчетливым',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 75,
          q: 'Долги я отдаю быстро и полностью',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 76,
          q: 'Иногда мне бывало так стыдно, что хотелось от всех спрятаться',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 77,
          q: 'Я склонен работать медленно, но равномерно',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 78,
          q: 'В жизни я стараюсь строго придерживаться проверенного, испытанного способа действий',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 79,
          q: 'Я стараюсь не проявлять свой гнев даже в тех случаях, когда он оправдан',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 80,
          q: 'Когда я делаю что-то в целях самосовершенствования, то через некоторое время бросаю это занятие',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 81,
          q: 'Мне легко устоять перед соблазнами',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 82,
          q: 'Бывало, я делал что-то лишь для того, чтобы встряхнуться и почувствовать захватывающее волнение',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 83,
          q: 'Мне нравится решать загадки и головоломки',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 84,
          q: 'Я знаю, что я лучше большинства людей',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 85,
          q: 'Я человек продуктивный, который всегда выполняет работу до конца',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 86,
          q: 'Когда я перегружен, у меня порой возникает чувство, что я разрываюсь на части',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 87,
          q: 'Я не являюсь жизнерадостным оптимистом',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 88,
          q: 'При разрешении моральных вопросов желательно принять во внимание принципы религии',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 89,
          q: 'Невозможно переоценить нужды бедных и престарелых людей',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 90,
          q: 'Порой я сначала что-то делаю, а потом думаю',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 91,
          q: 'Я часто испытываю скованность и нервное напряжение',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 92,
          q: 'Многие считают меня несколько холодным и отчужденным человеком',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 93,
          q: 'Я не люблю тратить время зря, предаваясь пустым мечтаниям',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 94,
          q: 'Я считаю, что большинство людей, с которыми я имею дело, честные, и им можно доверять',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 95,
          q: 'Я часто попадаю в ситуации, к которым я не совсем готов',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 96,
          q: 'Меня не считают обидчивым или вспыльчивым человеком',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 97,
          q: 'Когда я долго нахожусь в одиночестве, я испытываю сильное желание быть с людьми',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 98,
          q: 'Меня интересуют взаимосвязи и закономерности, которые я нахожу в природе и искусстве',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 99,
          q: 'Чрезмерная честность – помеха в денежных делах',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 100,
          q: 'Мне нравится хранить все на своих местах, чтобы знать, где что лежит',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 101,
          q: 'Мне случалось испытывать чувство вины и греховности',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 102,
          q: 'Во время собраний я обычно молчу, позволяя другим людям высказать их точку зрения',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 103,
          q: 'Я редко обращаю внимание на свои сиюминутные чувства',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 104,
          q: 'Обычно я стараюсь быть заботливым и внимательным',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 105,
          q: 'Играя во что-либо, я иногда жульничаю',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 106,
          q: 'Меня не слишком смущает, когда люди смеются надо мной и дразнят',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 107,
          q: 'Я часто чувствую себя так, будто я переполнен энергией',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 108,
          q: 'Мне нравится пробовать новую, необычную пищу',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 109,
          q: 'Если мне не нравится человек, то я даю ему об этом знать',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 110,
          q: 'Я настойчиво работаю для достижения своих целей',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 111,
          q: 'Когда я ем свою любимую пищу, я склонен переедать',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 112,
          q: 'Я избегаю смотреть фильмы ужасов',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 113,
          q: 'Иногда я теряю интерес, когда люди говорят на очень абстрактные, теоретические темы',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 114,
          q: 'Я стараюсь быть скромным',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 115,
          q: 'Мне трудно заставить себя делать то, что я должен делать',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 116,
          q: 'В экстремальных ситуациях я сохраняю хладнокровие',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 117,
          q: 'Иногда я просто переполнен счастьем',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 118,
          q: 'Я считаю, что все представления о добре и зле, имеющиеся у разных народов, имеют право на существование',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 119,
          q: 'Я не испытываю сострадания к нищим, просящие подаяние',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 120,
          q: 'Прежде чем что-либо предпринять, я всегда думаю о возможных последствиях',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 121,
          q: 'Я редко опасаюсь за будущее',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 122,
          q: 'Мне очень нравится общаться с людьми',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 123,
          q: 'Мне нравится сосредоточиться на фантазии или мечте и представлять ее во всех вариантах, обогащая и развивая ее',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 124,
          q: 'Меня настораживает, когда люди делают для меня что-то хорошее',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 125,
          q: 'Я горжусь своим благоразумием',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 126,
          q: 'Меня часто раздражают люди, с которыми приходится иметь дело',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 127,
          q: 'Я предпочитаю работу, которую могу выполнять наедине, когда меня не беспокоят другие люди',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 128,
          q: 'Поэзия не производит на меня практически никакого впечатления',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 129,
          q: 'Меня бы очень задело, если бы обо мне кто-то подумал, что я лицемер',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 130,
          q: 'Мне кажется, что я никогда не смогу быть организованным',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 131,
          q: 'Во всех неудачах я склонен винить только себя',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 132,
          q: 'Другие люди часто хотят, чтобы я помог им принять решение',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 133,
          q: 'Я испытываю самые разные чувства и эмоции',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 134,
          q: 'Меня не считают щедрым человеком',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 135,
          q: 'Когда я обещаю что-то сделать, можно быть уверенным что я это сделаю',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 136,
          q: 'Часто я чувствую себя неполноценным по отношению к другим людям',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 137,
          q: 'Я не такой подвижный и живой, как другие люди',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 138,
          q: 'Я предпочитаю проводить время в привычной для меня обстановке',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 139,
          q: 'Если меня оскорбили, я просто стараюсь простить и забыть',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 140,
          q: 'Я не стремлюсь непременно повышать свой социальный статус',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 141,
          q: 'Я редко поддаюсь импульсивным желаниям',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 142,
          q: 'Мне нравится быть в гуще событий',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 143,
          q: 'Мне нравится решать головоломки',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 144,
          q: 'Я очень высокого мнения о себе',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 145,
          q: 'Начатое дело я практически всегда довожу до конца',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 146,
          q: 'Часто мне бывает трудно сделать выбор',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 147,
          q: 'Я не считаю себя особенно веселым человеком',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 148,
          q: 'Я считаю, что верность идеалам и принципам важнее, чем восприимчивость к новому',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 149,
          q: 'Общечеловеческие нужды непременно должны преобладать над экономическими соображениями',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 150,
          q: 'Часто я делаю что-то под влиянием момента',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 151,
          q: 'Часто я волнуюсь из-за того, что что-то может не получиться',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 152,
          q: 'Мне легко быть общительным и приветливым с незнакомыми людьми',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 153,
          q: 'Если я чувствую, что погружаюсь в фантазии, что я обычно стараюсь занять себя работой или сконцентрироваться на какой-нибудь другой деятельности',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 154,
          q: 'Моей первой реакцией на людей является доверие',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 155,
          q: 'Я ни в чем не добиваюсь полного успеха',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 156,
          q: 'Меня трудно вывести из себя',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 157,
          q: 'Я предпочел бы отдыхать на шумном, оживленном пляже, чем в уединенной хижине в лесу',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 158,
          q: 'Некоторые стили музыки не перестают восхищать меня',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 159,
          q: 'Иногда я хитростью заставляю людей делать то, что я хочу',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 160,
          q: 'Я склонен быть требовательным и уделять внимание тому, чтобы все было сделано детально и точно',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 161,
          q: 'Я низкого мнения о себе',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 162,
          q: 'В жизни я предпочитаю «оставаться в тени», чем проявлять инициативу и становиться лидером для других',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 163,
          q: 'Я редко испытываю изменение настроений и чувств в зависимости от окружающей обстановки',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 164,
          q: 'Большинство людей, с которыми я общаюсь, мне симпатизируют',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 165,
          q: 'Я строго следую своим принципам в вопросах этики',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 166,
          q: 'Я чувствую себя вполне уютно в присутствии моего начальства или другого руководства',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 167,
          q: 'Я, похоже, постоянно куда-то спешу',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 168,
          q: 'Иногда я изменяю что-нибудь у себя дома просто для того, чтобы попробовать что-то новое',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 169,
          q: 'Если кто-то начинает ссору, я готов ответить тем же',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 170,
          q: 'Я прилагаю все усилия, чтобы достичь всего, чего я могу достичь',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 171,
          q: 'Иногда я переедаю так, что мне становится плохо',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 172,
          q: 'Мне нравится волнение, которое я испытываю на скоростных аттракционах',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 173,
          q: 'Мне не интересно размышлять о сущности вселенной или о состоянии человечества',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 174,
          q: 'Я считаю, что я нисколько не лучше других людей, независимо от их социального и материального положения',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 175,
          q: 'Когда дело, которое я начал, становится слишком трудным, я склонен начать новое',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 176,
          q: 'В критических ситуациях я довольно хорошо могу держать себя в руках',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 177,
          q: 'Я веселый и жизнерадостный человек',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 178,
          q: 'Я считаю себя человеком широких взглядов, терпимым к образу жизни других людей',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 179,
          q: 'Я считаю, что все люди заслуживают уважения',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 180,
          q: 'Я редко принимаю поспешные решения',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 181,
          q: 'У меня меньше страхов, чем у большинства людей',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 182,
          q: 'Эмоционально я сильно привязан к моим друзьям',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 183,
          q: 'В детстве я не любил игры, требующие воображения и фантазии',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 184,
          q: 'Я склонен ожидать от людей только хорошее',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 185,
          q: 'Я всегда берусь за дело со знанием и успешно его выполняю',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 186,
          q: 'Временами я испытываю чувство обиды и негодования',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 187,
          q: 'Многолюдные встречи и мероприятия мне скучны',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 188,
          q: 'иногда, когда я читаю стихи или смотрю на произведение искусства, я чувствую холодок или волну возбуждения',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 189,
          q: 'Иногда я запугиваю людей или льщу им, чтобы они сделали то, что  от них хочу',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 190,
          q: 'Я не особенно привередлив в отношении поддержания чистоты и порядка',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 191,
          q: 'Порой мне все кажется довольно мрачным и безнадежным',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 192,
          q: 'В общении с людьми я склонен говорить больше, чем мои собеседники',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 193,
          q: 'Мне легко сопереживать другим людям, то есть чувствовать то, что чувствуют они',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 194,
          q: 'Я считаю себя милосердным человеком',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 195,
          q: 'Я стараюсь выполнять работу добросовестно, так, чтобы ее не надо было переделывать',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 196,
          q: 'Если я сделал или сказал кому-либо что-то плохое, мне после этого стоит огромного труда снова посмотреть этому человеку в глаза',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 197,
          q: 'У меня быстрый ритм жизни',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 198,
          q: 'Я предпочитаю ездить на отдых в проверенное и облюбованное место',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 199,
          q: 'Я настойчив и упрям',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 200,
          q: 'Я стараюсь показать отличные результаты во всем, что я делаю',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 201,
          q: 'Иногда я совершаю опрометчивые поступки, о которых сожалею',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 202,
          q: 'Меня привлекают яркие цвета и броские стили',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 203,
          q: 'Я очень любознательна',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 204,
          q: 'Мне нравится хвалить других, чем слышать похвалы в свой адрес',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 205,
          q: 'Я часто не обращаю внимания на множество мелких дел, которые мне необходимо сделать',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 206,
          q: 'Даже когда кажется, что все идет не так, как надо, я все равно могу принимать хорошие решения',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 207,
          q: 'Я редко употребляю слова «превосходный» или «изумительный» чтобы описать события моей жизни',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 208,
          q: 'Я считаю, что к 25-ти годам человек должен иметь свои убеждения',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 209,
          q: 'Я сочувствую людям, которым менее повезло в жизни, чем мне',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 210,
          q: 'Когда я собираюсь в поездку, я все заранее тщательно планирую',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 211,
          q: 'Мне часто приходят в голову мысли, которые вызывают страх',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 212,
          q: 'Я стараюсь поближе узнать людей, с которыми я работаю',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 213,
          q: 'Мне бы было трудно позволить моим мыслям бесконтрольно «витать в облаках»',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 214,
          q: 'Я верю в добрые намерения людей',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 215,
          q: 'Я работаю эффективно и продуктивно',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 216,
          q: 'Даже мелкие неприятности могут расстроить меня',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 217,
          q: 'Мне нравятся вечеринки, где бывают много людей',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 218,
          q: 'Мне нравится читать стихи, где центральное место занимают чувства и образы, а не сюжет',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 219,
          q: 'Я горжусь своим хитроумием в обращении с людьми',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 220,
          q: 'Я трачу много времени на поиск вещей, которые я не положил на место',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 221,
          q: 'Слишком часто я разочаровываюсь и хочу сдаться, когда что-то идет не так',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 222,
          q: 'Мне нелегко брать контроль над ситуацией в свои руки',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 223,
          q: 'Странные вещи, например, определенные запахи или названия далеких мест, могут вызвать у меня сильные эмоции',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 224,
          q: 'Если я могу помочь другим, то я жертвую своими интересами',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 225,
          q: 'Я должен чувствовать себя очень плохо, чтобы позволить себе не выйти на работу',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 226,
          q: 'Когда люди, которых я знаю, делают глупость, мне становится за них неловко',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 227,
          q: 'Я очень активный человек',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 228,
          q: 'Когда я хожу или езжу, я стараюсь придерживаться одного и того же маршрута',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 229,
          q: 'Я часто доказываю свою правоту близким и коллегам по работе',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 230,
          q: 'Для меня работа притягательна почти как наркотик',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 231,
          q: 'Я всегда способен контролировать свои чувства',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 232,
          q: 'Мне нравится присутствовать на многолюдных спортивных мероприятиях',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 233,
          q: 'У меня много разнообразных интеллектуальных интересов',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 234,
          q: 'Я лучше других людей',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 235,
          q: 'Я обладаю хорошей самодисциплиной',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 236,
          q: 'Эмоционально я достаточно уравновешенный',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 237,
          q: 'Меня легко рассмешить',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 238,
          q: 'Я считаю, что современная мораль свободной жизни с минимумом ограничений – это просто отсутствие морали как таковой',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 239,
          q: 'Я бы предпочел, чтобы другие люди думали обо мне как о милосердном, а не как о справедливом человеке',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        },
        {
          id: 240,
          q: 'Прежде чем ответить на вопрос, я тщательно его обдумываю',
          a: ['абсолютно не согласен', 'не согласен', 'нейтрально', 'согласен', 'абсолютно согласен']
        }
      ],
      q2: [{id: 1, a: false}, {id: 2, a: false}, {id: 3, a: false}, {id: 4, a: false}, {id: 5, a: false}, {id: 6, a: false}, {id: 7, a: false}, {id: 8, a: false}, {id: 9, a: false}, {id: 10, a: false}, {id: 11, a: false}, {id: 12, a: false}, {id: 13, a: false}, {id: 14, a: false}, {id: 15, a: false}, {id: 16, a: false}, {id: 17, a: false}, {id: 18, a: false}, {id: 19, a: false}, {id: 20, a: false}, {id: 21, a: false}, {id: 22, a: false}, {id: 23, a: false}, {id: 24, a: false}, {id: 25, a: false}, {id: 26, a: false}, {id: 27, a: false}, {id: 28, a: false}, {id: 29, a: false}, {id: 30, a: false}, {id: 31, a: false}, {id: 32, a: false}, {id: 33, a: false}, {id: 34, a: false}, {id: 35, a: false}, {id: 36, a: false}, {id: 37, a: false}, {id: 38, a: false}, {id: 39, a: false}, {id: 40, a: false}, {id: 41, a: false}, {id: 42, a: false}, {id: 43, a: false}, {id: 44, a: false}, {id: 45, a: false}, {id: 46, a: false}, {id: 47, a: false}, {id: 48, a: false}, {id: 49, a: false}, {id: 50, a: false}, {id: 51, a: false}, {id: 52, a: false}, {id: 53, a: false}, {id: 54, a: false}, {id: 55, a: false}, {id: 56, a: false}, {id: 57, a: false}, {id: 58, a: false}, {id: 59, a: false}, {id: 60, a: false}, {id: 61, a: false}, {id: 62, a: false}, {id: 63, a: false}, {id: 64, a: false}, {id: 65, a: false}, {id: 66, a: false}, {id: 67, a: false}, {id: 68, a: false}, {id: 69, a: false}, {id: 70, a: false}, {id: 71, a: false}, {id: 72, a: false}, {id: 73, a: false}, {id: 74, a: false}, {id: 75, a: false}, {id: 76, a: false}, {id: 77, a: false}, {id: 78, a: false}, {id: 79, a: false}, {id: 80, a: false}, {id: 81, a: false}, {id: 82, a: false}, {id: 83, a: false}, {id: 84, a: false}, {id: 85, a: false}, {id: 86, a: false}, {id: 87, a: false}, {id: 88, a: false}, {id: 89, a: false}, {id: 90, a: false}, {id: 91, a: false}, {id: 92, a: false}, {id: 93, a: false}, {id: 94, a: false}, {id: 95, a: false}, {id: 96, a: false}, {id: 97, a: false}, {id: 98, a: false}, {id: 99, a: false}, {id: 100, a: false}, {id: 101, a: false}, {id: 102, a: false}, {id: 103, a: false}, {id: 104, a: false}, {id: 105, a: false}, {id: 106, a: false}, {id: 107, a: false}, {id: 108, a: false}, {id: 109, a: false}, {id: 110, a: false}, {id: 111, a: false}, {id: 112, a: false}, {id: 113, a: false}, {id: 114, a: false}, {id: 115, a: false}, {id: 116, a: false}, {id: 117, a: false}, {id: 118, a: false}, {id: 119, a: false}, {id: 120, a: false}, {id: 121, a: false}, {id: 122, a: false}, {id: 123, a: false}, {id: 124, a: false}, {id: 125, a: false}, {id: 126, a: false}, {id: 127, a: false}, {id: 128, a: false}, {id: 129, a: false}, {id: 130, a: false}, {id: 131, a: false}, {id: 132, a: false}, {id: 133, a: false}, {id: 134, a: false}, {id: 135, a: false}, {id: 136, a: false}, {id: 137, a: false}, {id: 138, a: false}, {id: 139, a: false}, {id: 140, a: false}, {id: 141, a: false}, {id: 142, a: false}, {id: 143, a: false}, {id: 144, a: false}, {id: 145, a: false}, {id: 146, a: false}, {id: 147, a: false}, {id: 148, a: false}, {id: 149, a: false}, {id: 150, a: false}, {id: 151, a: false}, {id: 152, a: false}, {id: 153, a: false}, {id: 154, a: false}, {id: 155, a: false}, {id: 156, a: false}, {id: 157, a: false}, {id: 158, a: false}, {id: 159, a: false}, {id: 160, a: false}, {id: 161, a: false}, {id: 162, a: false}, {id: 163, a: false}, {id: 164, a: false}, {id: 165, a: false}, {id: 166, a: false}, {id: 167, a: false}, {id: 168, a: false}, {id: 169, a: false}, {id: 170, a: false}, {id: 171, a: false}, {id: 172, a: false}, {id: 173, a: false}, {id: 174, a: false}, {id: 175, a: false}, {id: 176, a: false}, {id: 177, a: false}, {id: 178, a: false}, {id: 179, a: false}, {id: 180, a: false}, {id: 181, a: false}, {id: 182, a: false}, {id: 183, a: false}, {id: 184, a: false}, {id: 185, a: false}, {id: 186, a: false}, {id: 187, a: false}, {id: 188, a: false}, {id: 189, a: false}, {id: 190, a: false}, {id: 191, a: false}, {id: 192, a: false}, {id: 193, a: false}, {id: 194, a: false}, {id: 195, a: false}, {id: 196, a: false}, {id: 197, a: false}, {id: 198, a: false}, {id: 199, a: false}, {id: 200, a: false}, {id: 201, a: false}, {id: 202, a: false}, {id: 203, a: false}, {id: 204, a: false}, {id: 205, a: false}, {id: 206, a: false}, {id: 207, a: false}, {id: 208, a: false}, {id: 209, a: false}, {id: 210, a: false}, {id: 211, a: false}, {id: 212, a: false}, {id: 213, a: false}, {id: 214, a: false}, {id: 215, a: false}, {id: 216, a: false}, {id: 217, a: false}, {id: 218, a: false}, {id: 219, a: false}, {id: 220, a: false}, {id: 221, a: false}, {id: 222, a: false}, {id: 223, a: false}, {id: 224, a: false}, {id: 225, a: false}, {id: 226, a: false}, {id: 227, a: false}, {id: 228, a: false}, {id: 229, a: false}, {id: 230, a: false}, {id: 231, a: false}, {id: 232, a: false}, {id: 233, a: false}, {id: 234, a: false}, {id: 235, a: false}, {id: 236, a: false}, {id: 237, a: false}, {id: 238, a: false}, {id: 239, a: false}, {id: 240, a: false}]
    }
  },
  mounted() {
    if (localStorage.q2){
      this.q2 = JSON.parse(localStorage.q2);
      this.q2.forEach((item, i) => {
        if(item.a){
          this.quizNumber = i + 1;
          if( this.quizNumber >= this.q2.length ){
            this.$parent.quizNumber = this.$parent.quizNumber + 1;
          }
        }
      });
    }
  },
  methods: {
    quizAction(e) {
      let newArr = this.q2;
      newArr[this.quizNumber].a = e.target.value;
      this.q2 = newArr;
      localStorage.q2 = JSON.stringify(newArr);
      this.quizNumber = this.quizNumber + 1;
      if( this.quizNumber >= this.q2.length ){
        this.$parent.quizNumber = this.$parent.quizNumber + 1;
      }
    }
  }
}
</script>
<style lang="scss" scoped>
.answers{
  flex-wrap: wrap;
  .btn{
    display: inline-block;
    margin: 15px;
  }
}
</style>